STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    simple_nvm_arbiter.c
  * @author  MCD Application Team
  * @brief   The Simple NVM arbiter module provides an interface to write and/or
  *          restore data from SRAM to FLASH with use of NVMs.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

/* Memset */
#include <string.h>

/* Own header files */
#include "simple_nvm_arbiter.h"
#include "simple_nvm_arbiter_common.h"
#include "simple_nvm_arbiter_conf.h"

/* Target defines */
#include "stm32wbaxx_hal.h"

/* Needed modules */
#include "flash_manager.h"
#include "stm32wbaxx_hal_flash_ex.h"
#include "stm32wbaxx_hal_crc.h"

/* Tools */
#include "stm_list.h"
#include "utilities_common.h"

/* Global variables ----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Alignment 128bits for NVM Start address */
#define SNVMA_MASK_ALIGNMENT_128  0x0000000Fu

/* Alignment 32bits for Buffer addresses */
#define SNVMA_MASK_ALIGNMENT_32   0x00000003u

/* Flash memory erased content */
#define SNVMA_ERASED_CONTENT  0xFFFFu

/* Private macros ------------------------------------------------------------*/
/* Align an address on a 128 bits boundary */
#define SNVMA_ALIGN_128(p_Addr)  \
  ((p_Addr + SNVMA_MASK_ALIGNMENT_128) & ~SNVMA_MASK_ALIGNMENT_128)

/* Private typedef -----------------------------------------------------------*/

/* Flash operation steps */
typedef enum SNVMA_FlashOpSteps
{
  SNVMA_HEADER_WRITE,
  SNVMA_BUFFER_WRITE,
  SNVMA_ERASE_BANK,
  SNVMA_RETRY_WRITE
}SNVMA_FlashOpSteps_t;

/* Flash operation information */
typedef struct __PACKED SNVMA_FlashOpInfo
{
  /* Id of the NVM in use */
  uint8_t NvmId;
  /* Id of the buffer in use - Shall be set to 0 on first write */
  uint8_t BufferId;
  /* State of the flash operation */
  SNVMA_FlashOpSteps_t FlashOpState;
}SNVMA_FlashOpInfo_t;

/* Bank header */
typedef __PACKED_STRUCT __ALIGNED(16) SNVMA_BankHeader
{
  /* Unused value - Only for padding */
  uint8_t Empty;
  /* Bank counter - Indicates the freshness of the bank. The greater, the fresher */
  uint8_t Counter;
  /* Integrity check - CRC16 */
  uint16_t Crc;
  /* Buffer ID #1 */
  uint8_t BufferId1;
  /* Size used by user ID #1 */
  uint16_t SizeId1;
  /* Buffer ID #2 */
  uint8_t BufferId2;
  /* Size used by user ID #2 */
  uint16_t SizeId2;
  /* Buffer ID #3 */
  uint8_t BufferId3;
  /* Size used by user ID #3 */
  uint16_t SizeId3;
  /* Buffer ID #4 */
  uint8_t BufferId4;
  /* Size used by user ID #4 */
  uint16_t SizeId4;
}SNVMA_BankHeader_t;

/* Private variables ---------------------------------------------------------*/
/* Flag for module initialization */
static uint8_t SNVMA_ModuleInit = FALSE;

/* Flag for command pending */
static uint8_t SNVMA_CommandPending = FALSE;

/* Bitmask for write operation */
static uint32_t SNVMA_IdBitmask = 0x00000000;

/* Handle of HAL CRC */
static CRC_HandleTypeDef SNVMA_CrcHandle;

/* Bank header for write operation */
static SNVMA_BankHeader_t SNVMA_WriteBankHeader;

/* Callback struct for Flash manager */
static FM_CallbackNode_t SNVMA_FlashCallback;

/* Information of the ongoing flash operation */
static SNVMA_FlashOpInfo_t SNVMA_FlashInfo;

/* Representation of the Bank configuration */
static SNVMA_BankElt_t SNVMA_BankConfiguration[SNVMA_NUMBER_OF_BANKS];

/* Representation of the NVM configuration */
static SNVMA_NvmElt_t SNVMA_NvmConfiguration [SNVMA_NVM_NUMBER] =
{
  /* NVM ID #1 */
  {
    .BankNumber = SNVMA_NVM_ID_1_BANK_NUMBER,
    .BankSize = SNVMA_NVM_ID_1_BANK_SIZE,
  },
};

/* Callback prototypes -----------------------------------------------*/

/**
 * @brief Callback to be invoked by flash manager
 *
 * @details Informs about the result of the flash operation
 *
 * @param Status: Status of the flash operation
 *
 */
void SNVMA_FlashManagerCallback(FM_FlashOp_Status_t Status);

/* Private function prototypes -----------------------------------------------*/

/**
 * @brief Verify the credibility of a bank header
 *
 * @param p_BankStartAddress: Bank start address to verify header
 *
 * @return State of the Header
 * @retval TRUE: Header seems to be good
 * @retval FALSE: Header is not good
 */
static inline uint8_t IsHeaderOk (const uint32_t * const p_BankStartAddress, const uint8_t NvmId);

/**
 * @brief Verify the integrity of a bank
 *
 * @param p_BankStartAddress: Start address of the bank
 *
 * @return State of the CRC
 * @retval TRUE: CRC is OK
 * @retval FALSE: CRC is NOK
 */
static inline uint8_t IsCrcOk (const uint32_t * const p_BankStartAddress);

/**
 * @brief Verify that the source and the destination content are the same
 *
 * @param p_Source: Original content address
 * @param p_Destination: Content address to compare
 * @param Size: Size of the content to compare
 *
 * @return Result of a comparison between source and destination
 * @retval TRUE: Content is the same
 * @retval FALSE: Content is not the same
 */
static inline uint8_t IsSameContent (uint32_t * p_Source, uint32_t * p_Destination, uint32_t Size);

/**
 * @brief Determine which bank is the newest
 *
 * @param p_FirstBank: Pointer onto the first bank
 * @param p_SecondBankStartAddress: Pointer onto the second bank
 *
 * @return Pointer on the newest bank
 */
static inline SNVMA_BankElt_t * GetNewestBank (SNVMA_BankElt_t * p_FirstBank,
                                               SNVMA_BankElt_t * p_SecondBank);

/**
 * @brief Erase the sector(s) given in parameter
 *
 * @param SectorId: Sector ID to erase
 * @param SectorNumber: Number of sectors to erase
 *
 * @return State of the operation
 * @retval TRUE: Op. OK
 * @retval FALSE: Op. NOK
 */
static inline uint8_t EraseSector (const uint32_t SectorId, const uint32_t SectorNumber);

/**
 * @brief Start a write sequence with the header creation and write request
 *
 * @param NvmId: Id of the NVM in use
 *
 * @return State of the flash write operation
 */
static inline FM_Cmd_Status_t StartFlashWrite (const uint8_t NvmId);

/**
 * @brief Invoke all the NVM pending buffer registered callbacks
 *
 * @param NvmId: Id of the NVM in use
 * @param CallbackStatus: Status to propagate
 *
 * @return None
 */
static inline void InvokeBufferCallback (const uint8_t NvmId, const SNVMA_Callback_Status_t CallbackStatus);

/* Functions Definition ------------------------------------------------------*/
SNVMA_Cmd_Status_t SNVMA_Init (const uint32_t * p_NvmStartAddress)
{
  SNVMA_Cmd_Status_t error = SNVMA_ERROR_NOK;

