STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
  uint16_t bankConfIdx = 0x00;
  uint32_t nvmOffset = 0x00;
  uint32_t addressOffset = 0x00;

  SNVMA_BankElt_t * p_currentRestoreBank = NULL;

  /* Check if not already initialized */
  if (SNVMA_ModuleInit == TRUE)
  {
    error = SNVMA_ERROR_ALREADY_INIT;
  }
  /* Check NVM Null pointer */
  else if (p_NvmStartAddress == NULL)
  {
    error = SNVMA_ERROR_NVM_NULL;
  }
  /* Check 128bits alignment */
  else if (((uint32_t)p_NvmStartAddress & SNVMA_MASK_ALIGNMENT_128) != 0x00000000)
  {
    error = SNVMA_ERROR_NVM_NOT_ALIGNED;
  }
  /* Check that configuration will not overlap flash */
  else if ((SNVMA_NUMBER_OF_SECTOR_NEEDED > FLASH_PAGE_NB) ||
           ((uint32_t)p_NvmStartAddress + (SNVMA_NUMBER_OF_SECTOR_NEEDED * FLASH_PAGE_SIZE) >
            (FLASH_BASE_NS + FLASH_SIZE)))
  {
    error = SNVMA_ERROR_NVM_OVERLAP_FLASH;
  }
  else
  {
    /* Enter critical section */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Prepare CRC Handle for init */
    SNVMA_CrcHandle.Instance = CRC;
    SNVMA_CrcHandle.Init.DefaultPolynomialUse = DEFAULT_POLYNOMIAL_DISABLE;
    SNVMA_CrcHandle.Init.DefaultInitValueUse = DEFAULT_INIT_VALUE_ENABLE;
    SNVMA_CrcHandle.Init.CRCLength = CRC_POLYLENGTH_16B;
    SNVMA_CrcHandle.Init.GeneratingPolynomial = SNVMA_POLY_CRC16;
    SNVMA_CrcHandle.Init.InputDataInversionMode = CRC_INPUTDATA_INVERSION_NONE;
    SNVMA_CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
    SNVMA_CrcHandle.InputDataFormat = CRC_INPUTDATA_FORMAT_WORDS;

    /* Leave critical section */
    UTILS_EXIT_CRITICAL_SECTION ();

    if (HAL_CRC_Init (&SNVMA_CrcHandle) != HAL_OK)
    {
      error = SNVMA_ERROR_CRC_INIT;
    }
    else
    {
      /* Enter critical section */
      UTILS_ENTER_CRITICAL_SECTION();

      /* Prepare flash manager callback */
      SNVMA_FlashCallback.Callback = SNVMA_FlashManagerCallback;

      /* Compute nvm implantation offset */
      nvmOffset = (uint32_t)p_NvmStartAddress - FLASH_BASE_NS;

      /* Ensure all variable are initialized: Banks */
      memset ((void *)SNVMA_BankConfiguration,
              0x00,
              (sizeof(SNVMA_BankElt_t) * SNVMA_NUMBER_OF_BANKS));

      /* For each NVM */
      for (uint8_t nvmIdx = 0x00;
           nvmIdx < SNVMA_NVM_NUMBER;
           nvmIdx++)
      {
        p_currentRestoreBank = NULL;

        /* Get the first bank element of our NVM - Will be used as the bank list of the NVM */
        SNVMA_NvmConfiguration[nvmIdx].p_BankList = &SNVMA_BankConfiguration[bankConfIdx];

        /* For each bank ... */
        for (uint8_t bankIdx = 0x00;
             bankIdx < SNVMA_NvmConfiguration[nvmIdx].BankNumber;
             bankIdx++)
        {
          /* ... compute bank addresses */
          SNVMA_BankConfiguration[bankConfIdx].p_StartAddr = (uint32_t *)((uint32_t)p_NvmStartAddress + addressOffset);

          /* Shall this bank be the one in use */
          if (IsHeaderOk (SNVMA_BankConfiguration[bankConfIdx].p_StartAddr,
                          nvmIdx) == FALSE)
          {
            /* Erase the bank */
            while (EraseSector (((nvmOffset + addressOffset) / FLASH_PAGE_SIZE),
                                SNVMA_NvmConfiguration[nvmIdx].BankSize) == FALSE);
          }
          /* Check if CRC OK */
          else if (IsCrcOk (SNVMA_BankConfiguration[bankConfIdx].p_StartAddr) == FALSE)
          {
            /* Erase the bank */
            while (EraseSector (((nvmOffset + addressOffset) / FLASH_PAGE_SIZE),
                                SNVMA_NvmConfiguration[nvmIdx].BankSize) == FALSE);
          }
          /* Valid bank */
          else
          {
            /* Compute buffer addresses in the bank */
            if (SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore == NULL)
            {
              SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore = &SNVMA_BankConfiguration[bankConfIdx];
            }
            else
            {
              /* Get the current bank in use for this NVM */
              p_currentRestoreBank = SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore;

              /* Already have a valid bank in use, determine which bank is the newest */
              SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore = GetNewestBank (p_currentRestoreBank,
                                                                               &SNVMA_BankConfiguration[bankConfIdx]);

              if (SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore == p_currentRestoreBank)
              {
                /* Erase &SNVMA_BankConfiguration[bankConfIdx] */
                while (EraseSector (((nvmOffset + addressOffset) / FLASH_PAGE_SIZE),
                                    SNVMA_NvmConfiguration[nvmIdx].BankSize) == FALSE);
              }
              else
              {
                /* Erase p_currentRestoreBank */
                while (EraseSector ((((uint32_t)p_currentRestoreBank->p_StartAddr - FLASH_BASE_NS) / FLASH_PAGE_SIZE),
                                    SNVMA_NvmConfiguration[nvmIdx].BankSize) == FALSE);
              }
            }
          }

          /* Determine the next write bank, is there any bank for restore ? */
          if (SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore == NULL)
          {
            /* The bank for write will be the first of list */
            SNVMA_NvmConfiguration[nvmIdx].p_BankForWrite = &SNVMA_NvmConfiguration[nvmIdx].p_BankList[0];
          }
          /* Is the bank to restore the last one in the bank list */
          else if (SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore ==
                   &SNVMA_NvmConfiguration[nvmIdx].p_BankList[SNVMA_NvmConfiguration[nvmIdx].BankNumber - 1])
          {
            /* The bank for write will be the first of list */
            SNVMA_NvmConfiguration[nvmIdx].p_BankForWrite = &SNVMA_NvmConfiguration[nvmIdx].p_BankList[0];
          }
          else
          {
            /* The bank for write will be the one after the restore list */
            SNVMA_NvmConfiguration[nvmIdx].p_BankForWrite = SNVMA_NvmConfiguration[nvmIdx].p_BankForRestore + 1;
          }

