STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
            /* Reset command pending flag */
            SNVMA_CommandPending = FALSE;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();
          }
        }
        else
        {
          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Header has been properly written, update operation information */
          SNVMA_FlashInfo.FlashOpState = SNVMA_BUFFER_WRITE;

          /* Reset the buffer write counter */
          buffCnt = 0x00;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();

          /* Execute the first buffer write */
          flashFunRet = FM_Write (
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].p_Addr,
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->ap_BufferAddr[SNVMA_FlashInfo.BufferId],
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].Size,
            &SNVMA_FlashCallback);

          /* Check flash operation */
          if (flashFunRet == FM_ERROR)
          {
            /* Notify buffers callbacks */
            InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Clear the NVM bitmask */
            SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

            /* Reset command pending flag */
            SNVMA_CommandPending = FALSE;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();
          }
        }
      }
      /* Status == FM_OPERATION_AVAILABLE */
      else
      {
        /* Retry write operation of the header */
        flashFunRet = FM_Write ((uint32_t *)&SNVMA_WriteBankHeader,
                                SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr,
                                (sizeof (SNVMA_BankHeader_t) / sizeof (uint32_t)),
                                &SNVMA_FlashCallback);

        /* Check flash operation */
        if (flashFunRet == FM_ERROR)
        {
          /* Notify buffers callbacks */
          InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

          /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }

      break;
    }

    case SNVMA_BUFFER_WRITE:
    {
      /* Check flash operation status */
      if (Status == FM_OPERATION_COMPLETE)
      {
        /* Enter critical section */
        UTILS_ENTER_CRITICAL_SECTION();

        /* Update buffer Id */
        do
        {
          /* Search for the buffer to write - Not null */
          if (SNVMA_FlashInfo.BufferId < (SNVMA_MAX_NUMBER_BUFFER - 1))
          {
            SNVMA_FlashInfo.BufferId++;
          }
          else
          {
            SNVMA_FlashInfo.BufferId = 0x00;
          }

          buffCnt++;
        } while ((SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].p_Addr == NULL) &&
                 (buffCnt < SNVMA_MAX_NUMBER_BUFFER));

        /* Leave critical section */
        UTILS_EXIT_CRITICAL_SECTION ();

        /* Check if there is still some buffer to write */
        if (buffCnt < SNVMA_MAX_NUMBER_BUFFER)
        {
          flashFunRet = FM_Write (
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].p_Addr,
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->ap_BufferAddr[SNVMA_FlashInfo.BufferId],
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].Size,
            &SNVMA_FlashCallback);

          /* Check flash operation */
          if (flashFunRet == FM_ERROR)
          {
            /* Notify buffers callbacks */
            InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Clear the NVM bitmask */
            SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

            /* Reset command pending flag */
            SNVMA_CommandPending = FALSE;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();
          }
        }
        /* Buffer write is over */
        else
        {
          /* Check the integrity of the whole write operation */
          if (IsCrcOk (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr) == FALSE)
          {
            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Reschedule the whole write operation but first erase the bank */
            SNVMA_FlashInfo.FlashOpState = SNVMA_RETRY_WRITE;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();

            flashFunRet = FM_Erase ((((uint32_t)
                                      SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr -
                                        FLASH_BASE_NS) / FLASH_PAGE_SIZE),
                                      SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].BankSize,
                                      &SNVMA_FlashCallback);

            /* Check flash operation */
            if (flashFunRet == FM_ERROR)
            {
              /* Notify buffers callbacks */
              InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

              /* Enter critical section */
              UTILS_ENTER_CRITICAL_SECTION();

              /* Clear the NVM bitmask */
              SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

              /* Reset command pending flag */
              SNVMA_CommandPending = FALSE;

              /* Leave critical section */
              UTILS_EXIT_CRITICAL_SECTION ();
            }
          }
          else
          {
            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Pursue with a bank swap */
            tmpBank = SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForRestore;

            /* Make the restore bank pointing the new valid bank */
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForRestore =
              SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite;

            /* Check if it is the last bank element of the list */
            if (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite ==
                &SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].
                  p_BankList[(SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].BankNumber - 1)])
            {
              SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite =
                &SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankList[0x00];
            }
            else
            {
              SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite++;
            }

            /* Update buffer addresses from old write bank */
            for (uint8_t cnt = 0x00;
                 cnt < SNVMA_MAX_NUMBER_BUFFER;
                 cnt++)
            {
              if (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForRestore->ap_BufferAddr[cnt] != NULL)
              {
                SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->ap_BufferAddr[cnt] =
                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForRestore->ap_BufferAddr[cnt] -
                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForRestore->p_StartAddr +
                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr;
              }
            }

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();

            /* Erase the old restore bank */
            if (tmpBank != NULL)
            {
              /* Enter critical section */
              UTILS_ENTER_CRITICAL_SECTION();

              /* Update flash operation information */
              SNVMA_FlashInfo.FlashOpState = SNVMA_ERASE_BANK;

              /* Leave critical section */
              UTILS_EXIT_CRITICAL_SECTION ();

              flashFunRet = FM_Erase ((((uint32_t)tmpBank->p_StartAddr - FLASH_BASE_NS) / FLASH_PAGE_SIZE),
                                                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].BankSize,
                                                  &SNVMA_FlashCallback);

              /* Check flash operation */
              if (flashFunRet == FM_ERROR)
              {
                /* Notify buffers callbacks */
                InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

                /* Enter critical section */
                UTILS_ENTER_CRITICAL_SECTION();

                /* Clear the NVM bitmask */
                SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

