STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
                /* Reset command pending flag */
                SNVMA_CommandPending = FALSE;

                /* Leave critical section */
                UTILS_EXIT_CRITICAL_SECTION ();
              }
            }
            else
            {
              /* Notify buffers callbacks */
              InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_COMPLETE);

              /* Is there any new request ? */
              if (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp == 0x00)
              {
                /* Enter critical section */
                UTILS_ENTER_CRITICAL_SECTION();

                /* No more action on this NVM, clear the NVM bitmask */
                SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

                /* Leave critical section */
                UTILS_EXIT_CRITICAL_SECTION ();
              }

              /* Check whether there is another pending requests */
              if (SNVMA_IdBitmask != 0x00000000)
              {
                /* Determine which NVM is impacted */
                for (uint8_t cnt = 0x00;
                     cnt < SNVMA_MAX_NUMBER_NVM;
                     cnt++)
                {
                  if ((SNVMA_IdBitmask & (1u << cnt)) != 0x00)
                  {
                    /* Enter critical section */
                    UTILS_ENTER_CRITICAL_SECTION();

                    /* Update flash information */
                    SNVMA_FlashInfo.NvmId = cnt;
                    SNVMA_FlashInfo.FlashOpState = SNVMA_HEADER_WRITE;

                    /* Determine which buffer is impacted */
                    for (uint8_t idx = 0x00;
                        idx < SNVMA_MAX_NUMBER_BUFFER;
                        idx++)
                    {
                      if ((SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp & (1u << idx)) != 0x00)
                      {
                        SNVMA_FlashInfo.BufferId = idx;

                        break;
                      }
                    }

                    /* Leave critical section */
                    UTILS_EXIT_CRITICAL_SECTION ();

                    break;
                  }
                }

                /* Start the pending write operation */
                flashFunRet = StartFlashWrite (SNVMA_FlashInfo.NvmId);

                /* Check flash operation */
                if (flashFunRet == FM_ERROR)
                {
                  /* Notify buffers callbacks */
                  InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

                  /* Enter critical section */
                  UTILS_ENTER_CRITICAL_SECTION();

                  /* Clear the NVM bitmask */
                  SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

                  /* Reset command pending flag */
                  SNVMA_CommandPending = FALSE;

                  /* Leave critical section */
                  UTILS_EXIT_CRITICAL_SECTION ();
                }
                else
                {
                  /* Enter critical section */
                  UTILS_ENTER_CRITICAL_SECTION();

                  /* Set requests active */
                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp |=
                    (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp << SNVMA_MAX_NUMBER_BUFFER);

                  /* Erase pendings requests */
                  SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp &= 0xF0;

                  /* Leave critical section */
                  UTILS_EXIT_CRITICAL_SECTION ();
                }
              }
              /* No more stuff to do */
              else
              {
                /* Enter critical section */
                UTILS_ENTER_CRITICAL_SECTION();

                /* Reset command pending flag */
                SNVMA_CommandPending = FALSE;

                /* Leave critical section */
                UTILS_EXIT_CRITICAL_SECTION ();
              }
            }
          }
        }
      }
      /* Status == FM_OPERATION_AVAILABLE */
      else
      {
        /* Retry the buffer write */
        flashFunRet = FM_Write (
          SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].p_Addr,
          SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->ap_BufferAddr[SNVMA_FlashInfo.BufferId],
          SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].a_Buffers[SNVMA_FlashInfo.BufferId].Size,
          &SNVMA_FlashCallback);

        /* Check flash operation */
        if (flashFunRet == FM_ERROR)
        {
          /* Notify buffers callbacks */
          InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

          /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }
      break;
    }

    case SNVMA_ERASE_BANK:
    {
      /* Check flash operation status */
      if (Status == FM_OPERATION_COMPLETE)
      {
        /* Notify buffers callbacks */
        InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_COMPLETE);

        /* Is there any new request ? */
        if (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp == 0x00)
        {
          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* No more action on this NVM, clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }

        /* Check whether there is another pending requests */
        if (SNVMA_IdBitmask != 0x00000000)
        {
          /* Determine which NVM is impacted */
          for (uint8_t cnt = 0x00;
                cnt < SNVMA_MAX_NUMBER_NVM;
                cnt++)
          {
            if ((SNVMA_IdBitmask & (1u << cnt)) != 0x00)
            {
              /* Enter critical section */
              UTILS_ENTER_CRITICAL_SECTION();

