STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
              /* Update flash information */
              SNVMA_FlashInfo.NvmId = cnt;
              SNVMA_FlashInfo.FlashOpState = SNVMA_HEADER_WRITE;

              /* Determine which buffer is impacted */
              for (uint8_t idx = 0x00;
                   idx < SNVMA_MAX_NUMBER_BUFFER;
                   idx++)
              {
                if ((SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp & (1u << idx)) != 0x00)
                {
                  SNVMA_FlashInfo.BufferId = idx;

                  break;
                }
              }

              /* Leave critical section */
              UTILS_EXIT_CRITICAL_SECTION ();

              break;
            }
          }

          /* Start the pending write operation */
          flashFunRet = StartFlashWrite (SNVMA_FlashInfo.NvmId);

          /* Check flash operation */
          if (flashFunRet == FM_ERROR)
          {
            /* Notify buffers callbacks */
            InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Clear the NVM bitmask */
            SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

            /* Reset command pending flag */
            SNVMA_CommandPending = FALSE;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();
          }
          else
          {
            /* Enter critical section */
            UTILS_ENTER_CRITICAL_SECTION();

            /* Set requests active */
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp |=
              (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp << SNVMA_MAX_NUMBER_BUFFER);

            /* Erase pendings requests */
            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp &= 0xF0;

            /* Leave critical section */
            UTILS_EXIT_CRITICAL_SECTION ();
          }
        }
        /* No more stuff to do */
        else
        {
          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }
      /* Status == FM_OPERATION_AVAILABLE */
      else
      {
        flashFunRet = FM_Erase ((((uint32_t)tmpBank->p_StartAddr - FLASH_PAGE_SIZE) / FLASH_PAGE_SIZE),
                                            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].BankSize,
                                            &SNVMA_FlashCallback);

        /* Check flash operation */
        if (flashFunRet == FM_ERROR)
        {
          /* Notify buffers callbacks */
          InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

         /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }

      break;
    }

    case SNVMA_RETRY_WRITE:
    {
      /* Check flash operation status */
      if (Status == FM_OPERATION_COMPLETE)
      {
        /* Enter critical section */
        UTILS_ENTER_CRITICAL_SECTION();

        /* Erase OK, restart the write from the start */
        SNVMA_FlashInfo.FlashOpState = SNVMA_HEADER_WRITE;

        /* Determine which buffer is impacted */
        for (uint8_t idx = 0x00;
              idx < SNVMA_MAX_NUMBER_BUFFER;
              idx++)
        {
          if ((SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp & (1u << idx)) != 0x00)
          {

            SNVMA_FlashInfo.BufferId = idx;

            break;
          }
        }

        /* Leave critical section */
        UTILS_EXIT_CRITICAL_SECTION ();

        /* Retry write operation of the header */
        flashFunRet = StartFlashWrite (SNVMA_FlashInfo.NvmId);

        /* Check flash operation */
        if (flashFunRet == FM_ERROR)
        {
          /* Notify buffers callbacks */
          InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

          /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
        else
        {
          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Set requests active */
          SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp |=
            (SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp << SNVMA_MAX_NUMBER_BUFFER);

          /* Erase pendings requests */
          SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].PendingBufferWriteOp &= 0xF0;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }
      /* Status == FM_OPERATION_AVAILABLE */
      else
      {
        /* Retry erase operation */
        flashFunRet = FM_Erase ((((uint32_t)SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr -
                                            FLASH_PAGE_SIZE) / FLASH_PAGE_SIZE),
                                            SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].BankSize,
                                            &SNVMA_FlashCallback);

        /* Check flash operation */
        if (flashFunRet == FM_ERROR)
        {
          /* Notify buffers callbacks */
          InvokeBufferCallback (SNVMA_FlashInfo.NvmId, SNVMA_OPERATION_FAILED);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear the NVM bitmask */
          SNVMA_IdBitmask &= ~(1u << SNVMA_FlashInfo.NvmId);

