STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
          /* Reset command pending flag */
          SNVMA_CommandPending = FALSE;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }
      }

      break;
    }

    default:
    {
      /* Do nothing */
      break;
    }
  }
}

/* Private functions Definition ------------------------------------------------------*/

uint8_t IsHeaderOk (const uint32_t * const p_BankStartAddress, const uint8_t NvmId)
{
  uint8_t error = FALSE;

  /* Check all the struct members to verify if the header could be any good */
  /* First, check if it is not erased */
  if ((((SNVMA_BankHeader_t *)p_BankStartAddress)->Empty == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->Counter == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->Crc == SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId1 == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId1 == SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId2 == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId2 == SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId3 == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId3 == SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId4 == (uint8_t)SNVMA_ERASED_CONTENT) &&
      (((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId4 == SNVMA_ERASED_CONTENT))
  {
    error = FALSE;
  }
  /* Check that written sizes does not overlap the bank */
  else if ((((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId1 +
            ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId2 +
            ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId3 +
            ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId4) >
           ((SNVMA_NvmConfiguration[NvmId].BankSize * FLASH_PAGE_SIZE) / sizeof (uint32_t)))
  {
    error = FALSE;
  }
  /* Now check IDs range */
  else if (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId1 != (NvmId * SNVMA_MAX_NUMBER_BUFFER))
  {
    error = FALSE;
  }
  else if (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId2 != ((NvmId * SNVMA_MAX_NUMBER_BUFFER) + 1))
  {
    error = FALSE;
  }
  else if (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId3 != ((NvmId * SNVMA_MAX_NUMBER_BUFFER) + 2))
  {
    error = FALSE;
  }
  else if (((SNVMA_BankHeader_t *)p_BankStartAddress)->BufferId4 != ((NvmId * SNVMA_MAX_NUMBER_BUFFER) + 3))
  {
    error = FALSE;
  }
  else
  {
    /* Header can be good */
    error = TRUE;
  }

  return error;
}

uint8_t IsCrcOk (const uint32_t * const p_BankStartAddress)
{
  uint8_t error = FALSE;

  uint16_t crcComputedValue = 0x00;
  uint32_t * payloadAddr = (uint32_t *)((uint32_t)(p_BankStartAddress) + sizeof (SNVMA_BankHeader_t));
  uint32_t offSet = 0x00;

  /* First buffer CRC computation */
  crcComputedValue = HAL_CRC_Calculate (&SNVMA_CrcHandle,
                                        payloadAddr,
                                        ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId1);

  offSet = SNVMA_ALIGN_128(((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId1 * sizeof (uint32_t));

  /* Second buffer CRC computation */
  crcComputedValue = HAL_CRC_Accumulate (&SNVMA_CrcHandle,
                                         (uint32_t *)((uint32_t)payloadAddr + offSet),
                                         ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId2);

  offSet += SNVMA_ALIGN_128(((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId2 * sizeof (uint32_t));

  /* Third buffer CRC computation */
  crcComputedValue = HAL_CRC_Accumulate (&SNVMA_CrcHandle,
                                         (uint32_t *)((uint32_t)payloadAddr + offSet),
                                         ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId3);

  offSet += SNVMA_ALIGN_128(((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId3 * sizeof (uint32_t));

  /* Second buffer CRC computation */
  crcComputedValue = HAL_CRC_Accumulate (&SNVMA_CrcHandle,
                                         (uint32_t *)((uint32_t)payloadAddr + offSet),
                                         ((SNVMA_BankHeader_t *)p_BankStartAddress)->SizeId4);

  /* Compare the CRC values */
  if (crcComputedValue == ((SNVMA_BankHeader_t *)p_BankStartAddress)->Crc)
  {
    error = TRUE;
  }

  return error;
}

uint8_t IsSameContent (uint32_t * p_Source, uint32_t * p_Destination, uint32_t Size)
{
  uint8_t error = TRUE;

  /* Compare both contents */
  for (uint32_t cnt = 0x00;
       (cnt < Size) && (error == TRUE);
       cnt++)
  {
    if (p_Source[cnt] != p_Destination[cnt])
    {
      error = FALSE;
    }
  }

  return error;
}

SNVMA_BankElt_t * GetNewestBank (SNVMA_BankElt_t * p_FirstBank,
                                 SNVMA_BankElt_t * p_SecondBank)
{
  SNVMA_BankElt_t * error = p_FirstBank;

  SNVMA_BankHeader_t * p_FirstBankHeader = (SNVMA_BankHeader_t *)p_FirstBank->p_StartAddr;
  SNVMA_BankHeader_t * p_SecondBankHeader = (SNVMA_BankHeader_t *)p_SecondBank->p_StartAddr;

  /* Check which has the greatest counter value */
  if (p_FirstBankHeader->Counter <
      p_SecondBankHeader->Counter)
  {
    if ((p_SecondBankHeader->Counter -
         p_FirstBankHeader->Counter) != 0xFF)
    {
      error = p_SecondBank;
    }
  }

  return error;
}

uint8_t EraseSector (const uint32_t SectorId, const uint32_t SectorNumber)
{
  uint8_t error = FALSE;

  uint32_t pageError = 0x00;

  FLASH_EraseInitTypeDef eraseInit =
  {
    .TypeErase = FLASH_TYPEERASE_PAGES,
    .Page = SectorId,
    .NbPages = SectorNumber,
  };

  HAL_FLASH_Unlock();

  if (HAL_FLASHEx_Erase(&eraseInit, &pageError) != HAL_OK)
  {
    error = FALSE;
  }
  else if (pageError != 0xFFFFFFFFu)
  {
    error = FALSE;
  }
  else
  {
    error = TRUE;
  }

  HAL_FLASH_Lock();

  return error;
}

