STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_HeartRate/System/Modules/Flash/simple_nvm_arbiter.c
FM_Cmd_Status_t StartFlashWrite (const uint8_t NvmId)
{
  FM_Cmd_Status_t error = FM_ERROR;

  uint16_t crcValue = 0x00;

  /* Reset value of SNVMA_BankHeader */
  memset ((void *)&SNVMA_WriteBankHeader,
          0x00,
          sizeof (SNVMA_BankHeader_t));

  /* Calculate CRC for every buffer */
  for (uint8_t cnt = 0x00;
       cnt < SNVMA_MAX_NUMBER_BUFFER;
       cnt++)
  {
    if (SNVMA_NvmConfiguration[NvmId].a_Buffers[cnt].p_Addr != NULL)
    {
      /* First crc computation */
      if (crcValue == 0x00)
      {
        crcValue = HAL_CRC_Calculate (&SNVMA_CrcHandle,
                                      SNVMA_NvmConfiguration[NvmId].a_Buffers[cnt].p_Addr,
                                      SNVMA_NvmConfiguration[NvmId].a_Buffers[cnt].Size);
      }
      else
      {
        crcValue = HAL_CRC_Accumulate (&SNVMA_CrcHandle,
                                       SNVMA_NvmConfiguration[NvmId].a_Buffers[cnt].p_Addr,
                                       SNVMA_NvmConfiguration[NvmId].a_Buffers[cnt].Size);
      }
    }
  }

  /* -- Build the header -- */

  /* Enter critical section */
  UTILS_ENTER_CRITICAL_SECTION();

  /* Check if there is an old bank to pursue counter value */
  if (SNVMA_NvmConfiguration[NvmId].p_BankForRestore != NULL)
  {
    SNVMA_WriteBankHeader.Counter = (((SNVMA_BankHeader_t *)
                                      (SNVMA_NvmConfiguration[NvmId].p_BankForRestore->p_StartAddr))->Counter) + 1;
  }

  /* Update CRC value */
  SNVMA_WriteBankHeader.Crc = crcValue;

  /* Update buffers info */
  SNVMA_WriteBankHeader.BufferId1 = (NvmId * SNVMA_MAX_NUMBER_BUFFER);
  SNVMA_WriteBankHeader.SizeId1 = SNVMA_NvmConfiguration[NvmId].a_Buffers[0x00].Size;
  SNVMA_WriteBankHeader.BufferId2 = (NvmId * SNVMA_MAX_NUMBER_BUFFER) + 1u;
  SNVMA_WriteBankHeader.SizeId2 = SNVMA_NvmConfiguration[NvmId].a_Buffers[0x01].Size;
  SNVMA_WriteBankHeader.BufferId3 = (NvmId * SNVMA_MAX_NUMBER_BUFFER) + 2u;
  SNVMA_WriteBankHeader.SizeId3 = SNVMA_NvmConfiguration[NvmId].a_Buffers[0x02].Size;
  SNVMA_WriteBankHeader.BufferId4 = (NvmId * SNVMA_MAX_NUMBER_BUFFER) + 3u;
  SNVMA_WriteBankHeader.SizeId4 = SNVMA_NvmConfiguration[NvmId].a_Buffers[0x03].Size;

  /* Leave critical section */
  UTILS_EXIT_CRITICAL_SECTION ();

  /* Write the header */
  error = FM_Write ((uint32_t *)&SNVMA_WriteBankHeader,
                                SNVMA_NvmConfiguration[NvmId].p_BankForWrite->p_StartAddr,
                                (sizeof (SNVMA_BankHeader_t) / sizeof (uint32_t)),
                                &SNVMA_FlashCallback);

  return error;
}

void InvokeBufferCallback (const uint8_t NvmId, const SNVMA_Callback_Status_t CallbackStatus)
{
  uint8_t pendingShift = 0x00;
  uint8_t tmpMask = 0x00;

  for (pendingShift = 0x00;
       ((SNVMA_NvmConfiguration[NvmId].PendingBufferWriteOp != 0x00) &&
        (pendingShift < SNVMA_MAX_NUMBER_BUFFER));
       pendingShift++)
  {
    tmpMask = SNVMA_NvmConfiguration[NvmId].PendingBufferWriteOp &
              (1u << (pendingShift + SNVMA_MAX_NUMBER_BUFFER));

    /* Is there an active write request ? */
    if (tmpMask != 0x00)
    {
      /* Has a new request come ? */
      if ((SNVMA_NvmConfiguration[NvmId].PendingBufferWriteOp & (1u << pendingShift)) == 0x00)
      {
        if (SNVMA_NvmConfiguration[NvmId].a_Callback[pendingShift] != NULL)
        {
          /* Invoke callback */
          SNVMA_NvmConfiguration[NvmId].a_Callback[pendingShift] (CallbackStatus);

          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

          /* Clear callback list */
          SNVMA_NvmConfiguration[NvmId].a_Callback[pendingShift] = NULL;

          /* Leave critical section */
          UTILS_EXIT_CRITICAL_SECTION ();
        }

        /* Enter critical section */
        UTILS_ENTER_CRITICAL_SECTION();

        /* Remove this pending buffer from the active list */
        SNVMA_NvmConfiguration[NvmId].PendingBufferWriteOp &= ~(1u << (pendingShift + SNVMA_MAX_NUMBER_BUFFER));

        /* Leave critical section */
        UTILS_EXIT_CRITICAL_SECTION ();
      }
      else
      {
        /* Do not notify, a retry shall be planned */
      }
    }
  }
}
